; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared1 - mode
	infrared4 - mode
	image2 - mode
	image6 - mode
	infrared3 - mode
	infrared0 - mode
	thermograph5 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star6)
	(supports instrument1 image2)
	(supports instrument1 thermograph5)
	(supports instrument1 image6)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
)
(:goal (and
	(have_image Star7 image6)
	(have_image Star7 infrared4)
	(have_image Phenomenon8 infrared3)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 image2)
))

)

; plan
1. (turn_to satellite0 star6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
5. (take_image satellite0 star7 instrument0 infrared4)
   added: (have_image star7 infrared4)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon8 instrument0 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 3 of 7
10. (take_image satellite0 phenomenon10 instrument0 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 4 of 7
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 7
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 7
13. (turn_to satellite0 star0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star0)
   goals met: 4 of 7
14. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 4 of 7
15. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 7
16. (take_image satellite0 phenomenon11 instrument1 image2)
   added: (have_image phenomenon11 image2)
   goals met: 5 of 7
17. (turn_to satellite0 star7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star7)
   goals met: 5 of 7
18. (take_image satellite0 star7 instrument1 image6)
   added: (have_image star7 image6)
   goals met: 6 of 7
19. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 6 of 7
20. (take_image satellite0 star9 instrument1 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 7
